
&После("СформироватьЗаказПокупателя")
Процедура днк_СформироватьЗаказПокупателя(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати, Ошибки, КодЯзыкаПечать)
	ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПечатнаяФорма.ПолныйПутьКМакету);
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.Номер КАК Номер,
	|	ЗаказПокупателя.Дата КАК ДатаДокумента,
	|	ЗаказПокупателя.Ответственный КАК Ответственный,
	|	ЗаказПокупателя.Организация.Префикс КАК Префикс,
	|	ЗаказПокупателя.КонтактноеЛицо КАК ДоставкаГрузополучатель,
	|	ЗаказПокупателя.КонтактныйТелефон КАК ДоставкаКонтактныйТелефон,
	|	ЗаказПокупателя.ЗапаснойТелефон КАК ДоставкаЗапаснойТелефон,
	|	ЗаказПокупателя.ПочтаПолучателя КАК ДоставкаПочтаПолучателя,
	|	ЗаказПокупателя.СпособДоставки КАК ДоставкаСпособДоставки,
	|	ЗаказПокупателя.ОжидаемаяДатаВручения КАК ДоставкаДата,
	|	ЗаказПокупателя.ВремяДоставкиС КАК ДоставкаВремяДоставкиС,
	|	ЗаказПокупателя.ВремяДоставкиПо КАК ДоставкаВремяДоставкиПо,
	|	ЗаказПокупателя.СлужбаДоставки КАК ДоставкаСлужбаДоставки,
	|	ЗаказПокупателя.Курьер КАК ДоставкаКурьер,
	|	ЗаказПокупателя.АдресДоставки КАК ДоставкаАдресДоставки,
	|	ЗаказПокупателя.ПунктВыдачиЗаказа КАК ДоставкаПунктВыдачиЗаказа,
	|	ЗаказПокупателя.ДополнительнаяИнформацияПоДоставке КАК ДоставкаКомментарий,
	|	ЗаказПокупателя.Высота КАК ДоставкаВысота,
	|	ЗаказПокупателя.Длина КАК ДоставкаДлина,
	|	ЗаказПокупателя.Ширина КАК ДоставкаШирина,
	|	ЗаказПокупателя.Объем КАК ДоставкаОбъем,
	|	ЗаказПокупателя.Вес КАК ДоставкаВес,
	|	ЗаказПокупателя.ОбъявленнаяЦенность КАК ДоставкаОбъявленнаяЦенность,
	|	ЗаказПокупателя.Комментарий КАК ЗаказКомментарий,
	|	ЗаказПокупателя.Работы.(
	|		НомерСтроки КАК НомерСтроки
	|	) КАК ТаблицаРаботыУслуги,
	|	ЗаказПокупателя.Запасы.(
	|		НомерСтроки КАК НомерСтроки
	|	) КАК ТаблицаЗапасы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&МассивОбъектов)
	|	И (ЗаказПокупателя.ОсновнойВариантКП = 0
	|			ИЛИ ЗаказПокупателя.Запасы.НомерВариантаКП = ЗаказПокупателя.ОсновнойВариантКП)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ЗаказПокупателя.Работы.НомерСтроки,
	|	ЗаказПокупателя.Запасы.НомерСтроки";
	
	ДанныеДокументов = Запрос.Выполнить().Выгрузить();
	
	Для каждого Шапка Из ДанныеДокументов Цикл

		ЗаказЗаказ = СтрШаблон(
			НСтр("ru='Заказ покупателя № %1 от %2';uk='Замовлення покупця № %1 від %2'", КодЯзыкаПечать),
			ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс),
			ПечатьДокументовУНФ.ПредставлениеДатыВДокументах(Шапка.ДатаДокумента, КодЯзыкаПечать)
		);
		
		ДоставкаГрузополучатель = "";
		
		Если ЗначениеЗаполнено(Шапка.ДоставкаГрузополучатель) Тогда
			ДоставкаГрузополучатель = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.ДоставкаГрузополучатель, Шапка.ДатаДокумента, ,);
			Если Не ЗначениеЗаполнено(ДоставкаГрузополучатель.Представление) Тогда
				ДоставкаГрузополучатель = Шапка.ДоставкаГрузополучатель;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено((Шапка.ДоставкаКонтактныйТелефон+Шапка.ДоставкаЗапаснойТелефон+Шапка.ДоставкаПочтаПолучателя)) Тогда
			ДоставкаГрузополучатель = ДоставкаГрузополучатель + Символы.ПС;
			ДоставкаГрузополучательКонтакты = (?(ЗначениеЗаполнено(Шапка.ДоставкаКонтактныйТелефон), "тел. "+Шапка.ДоставкаКонтактныйТелефон, ""));
			ДоставкаГрузополучательКонтакты = ДоставкаГрузополучательКонтакты +
				(?(ЗначениеЗаполнено(Шапка.ДоставкаЗапаснойТелефон), (?(НЕ ЗначениеЗаполнено(ДоставкаГрузополучательКонтакты), "тел. ", ",")) + Шапка.ДоставкаЗапаснойТелефон, ""));
			ДоставкаГрузополучательКонтакты = ДоставкаГрузополучательКонтакты +
				(?(ЗначениеЗаполнено(Шапка.ДоставкаПочтаПолучателя), (?(ЗначениеЗаполнено(ДоставкаГрузополучательКонтакты), ",",""))+"email "+Шапка.ДоставкаПочтаПолучателя, ""));
			ДоставкаГрузополучатель = ДоставкаГрузополучатель + ДоставкаГрузополучательКонтакты;
		КонецЕсли;
		
		ДоставкаДатаВремя = "";
		Если ЗначениеЗаполнено(Шапка.ДоставкаДата) Тогда 
			ДоставкаДатаВремя = СтрШаблон("%1", Формат(Шапка.ДоставкаДата, "ДЛФ=Д;ДП=""""")) +
				(?(ЗначениеЗаполнено(Шапка.ДоставкаВремяДоставкиС), СтрШаблон(", с %1",Формат(Шапка.ДоставкаВремяДоставкиС, "ДЛФ=В")),""))+
				(?(ЗначениеЗаполнено(Шапка.ДоставкаВремяДоставкиПо), СтрШаблон(", до %1",Формат(Шапка.ДоставкаВремяДоставкиС, "ДЛФ=В")),""));
		КонецЕсли;
				
		ДоставкаСлужбаДоставки = Строка(Шапка.ДоставкаСлужбаДоставки) + Строка(?(ЗначениеЗаполнено(Шапка.ДоставкаСпособДоставки), ", " + Шапка.ДоставкаСпособДоставки, "")) + Символы.ПС;
		
		ДоставкаАдресДоставки = "";
		ДоставкаАдресДоставки = ?(ЗначениеЗаполнено(Шапка.ДоставкаАдресДоставки), Шапка.ДоставкаАдресДоставки, "")+
			?(ЗначениеЗаполнено(Шапка.ДоставкаПунктВыдачиЗаказа), ", "+Шапка.ДоставкаПунктВыдачиЗаказа,"");
		
		ДоставкаГабариты = "";
		Если ЗначениеЗаполнено(Шапка.ДоставкаВысота) Или ЗначениеЗаполнено(Шапка.ДоставкаДлина) Или ЗначениеЗаполнено(Шапка.ДоставкаШирина) Тогда 
			ДоставкаГабариты = ?(ЗначениеЗаполнено(Шапка.ДоставкаДлина),Строка(Шапка.ДоставкаДлина),"<не указано>")+"x"+
				?(ЗначениеЗаполнено(Шапка.ДоставкаШирина),Строка(Шапка.ДоставкаШирина),"<не указано>")+"x"+
				?(ЗначениеЗаполнено(Шапка.ДоставкаВысота),Строка(Шапка.ДоставкаВысота),"<не указано>")+"см";
		КонецЕсли;
		
		ДанныеПечати = Новый Структура;
		
		ДанныеПечати.Вставить("ЗаказЗаказ", ЗаказЗаказ);
		ДанныеПечати.Вставить("ЗаказОтветственный", Шапка.Ответственный);
		ДанныеПечати.Вставить("ЗаказКомментарий", Шапка.ЗаказКомментарий);
	
		ДанныеПечати.Вставить("ДоставкаГрузополучатель", ДоставкаГрузополучатель);
		ДанныеПечати.Вставить("ДоставкаДатаВремя", ДоставкаДатаВремя);
		ДанныеПечати.Вставить("ДоставкаСлужбаДоставки", ДоставкаСлужбаДоставки);
		ДанныеПечати.Вставить("ДоставкаАдресДоставки", ДоставкаАдресДоставки);
		ДанныеПечати.Вставить("ДоставкаКурьер", Шапка.ДоставкаКурьер);
		ДанныеПечати.Вставить("ДоставкаГабариты", ДоставкаГабариты);
		ДанныеПечати.Вставить("ДоставкаВес", Шапка.ДоставкаВес);
		ДанныеПечати.Вставить("ДоставкаОбъем", Шапка.ДоставкаОбъем);
		ДанныеПечати.Вставить("ДоставкаОбъявленнаяЦенность", Шапка.ДоставкаОбъявленнаяЦенность);
		ДанныеПечати.Вставить("ДоставкаКомментарий", Шапка.ДоставкаКомментарий);
		
		//ОбластьМакета = Макет.ПолучитьОбласть("ЗаказКомментарий");
		//ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		//ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Доставка");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтладкаПоказатьЗначение(Значение)
	
КонецПроцедуры
