
&Вместо("ЕДРПОУСоответствуетТребованиям")
Функция днк_ЕДРПОУСоответствуетТребованиям(Знач КодПоЕДРПОУ, ЭтоЮридическоеЛицо, ТекстСообщения)
	
//	Результат = ПродолжитьВызов(Код, ЭтоЮридическоеЛицо, ТекстСообщения);
	
	Код       = СокрЛП(КодПоЕДРПОУ);
	ДлинаКода = СтрДлина(Код);

	Если (ЭтоЮридическоеЛицо = Неопределено) Или (ТипЗнч(ЭтоЮридическоеЛицо) <> Тип("Булево")) Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru='Не определен тип владельца кода по ЕДРПОУ.';uk='Не визначений тип власника коду по ЄДРПОУ.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭтоЮридическоеЛицо Тогда
		Результат = днкРегламентированныеДанныеКлиентСервер.днкЕГРПОУСоответствуетТребованиям(Код, ТекстСообщения);
	Иначе
		Результат = днкРегламентированныеДанныеКлиентСервер.днкГРФЛСоответствуетТребованиям(Код, ТекстСообщения);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
