&НаСервере
Процедура днк_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
    Документ = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.ЗаказПокупателя"));
    УстановитьСоответствиеОбъектаИРеквизитаФормы(Документ, "Объект");
	Если Документ.ПлатежныйКалендарь.Количество() < 1 Тогда
	   	Сообщение = Новый СообщениеПользователю();
   		Сообщение.Текст =  НСтр("ru='Необходимо запланировать сроки оплаты!';uk='Необхідно запланувати терміни оплати!'");
	   	Сообщение.Поле = "ЗапланироватьОплату";
	   	Сообщение.УстановитьДанные(Документ);
	   	Сообщение.Сообщить();
	    // Так как информация в документе не консистентна, то продолжать работу дальше смысла нет
	   	Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура днк_ПлатежныйКалендарьДатаОплатыПриИзмененииПосле(Элемент)
	Если Элементы.РедактироватьСписком.Пометка Тогда
		ТекущаяСтрока = Элементы.СписокПлатежныйКалендарь.ТекущиеДанные;
	Иначе
		ТекущаяСтрока = Объект.ПлатежныйКалендарь[0];
	КонецЕсли;
	
//	КонтрольнаяДата = Объект.Дата + ПолучитьСрокОплатыПокупателя(Объект.Договор) * 86400;
	КонтрольнаяДата = Объект.Дата;
	
	Если ТекущаяСтрока.ДатаОплаты < КонтрольнаяДата Тогда ТекущаяСтрока.ДатаОплаты = КонтрольнаяДата; КонецЕсли;
КонецПроцедуры
